<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN"
        "http://www.w3.org/MarkUp/Wilbur/HTML32.dtd">
<!--Converted with LaTeX2HTML 97.1 (release) (July 13th, 1997)
 by Nikos Drakos (nikos@cbl.leeds.ac.uk), CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippman, Marek Rouchal, Martin Wilck and others
* Anpassung an den HTML-Standard: Alexander Nouak, zeitform Internet Dienste -->
<html>
<head>
<title>GNU General Public License</title>
<meta name="description" content="GNU General Public License">
<meta name="keywords" content="gpl-ger">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- <LINK REL="STYLESHEET" HREF="gpl-ger.css"> -->
</head>
<body>
  <h1>
    Inhaltsverzeichnis
  </h1>
  <ul>
    <li><a href="#anm">Deutsche &Uuml;bersetzung der GNU&nbsp;General&nbsp;Public&nbsp;License</a></li>
    <li><a href="#gpl">GNU General Public License</a>
      <ul>
        <li><a href="#pre">Vorwort</a></li>
        <li><a href="#term">Allgemeine &Ouml;ffentliche GNU-Lizenz Bedingungen f&uuml;r die Vervielf&auml;ltigung, Verbreitung und Bearbeitung</a></li>
        <li><a href="#app">Anhang: Wie Sie diese Bedingungen auf Ihre eigenen, neuen Programme anwenden k&ouml;nnen</a></li>
      </ul></li>
    <li><a href="#about">&Uuml;ber dieses Dokument...</a></li>
  </ul>
  <hr>
  <h1>
    <a name="anm">Deutsche &Uuml;bersetzung der GNU&nbsp;General&nbsp;Public&nbsp;License</a>
  </h1>
  <p><small>
    Erstellt im Auftrag der S.u.S.E.&nbsp;GmbH <tt>http://www.suse.de</tt><br>
    von Katja Lachmann &Uuml;bersetzungen,<br>
    &uuml;berarbeitet von Peter Gerwinski (31.&nbsp;Oktober 1996, 4.&nbsp;Juni 2000)
  </small></p>
  <p>
    Diese &Uuml;bersetzung wird mit der Absicht angeboten, das Verst&auml;ndnis der <em>GNU General Public License</em>  (GNU-GPL) zu erleichtern. Es handelt sich jedoch nicht um eine offizielle oder im rechtlichen Sinne anerkannte &Uuml;bersetzung.
  </p>
  <p>
    Die <em>Free Software Foundation</em>  (FSF) ist nicht der Herausgeber dieser &Uuml;bersetzung, und sie hat diese &Uuml;bersetzung auch nicht als rechtskr&auml;ftigen Ersatz f&uuml;r die Original-GNU-GPL anerkannt. Da die &Uuml;bersetzung nicht sorgf&auml;ltig von Anw&auml;lten &uuml;berpr&uuml;ft wurde, k&ouml;nnen die &Uuml;bersetzer nicht garantieren, da&szlig; die &Uuml;bersetzung die rechtlichen Aussagen der GNU-GPL exakt wiedergibt. Wenn Sie sichergehen wollen, da&szlig; von Ihnen geplante Aktivit&auml;ten im Sinne der GNU-GPL gestattet sind, halten Sie sich bitte an die <a href="http://www.gnu.org/copyleft/gpl.html">englischsprachige Originalversion</a>.
  </p>
  <p>
    Die <em>Free Software Foundation</em>  m&ouml;chte Sie darum bitten, diese &Uuml;bersetzung nicht als offizielle Lizenzbedingungen f&uuml;r von Ihnen geschriebene Programme zu verwenden. Bitte benutzen Sie hierf&uuml;r stattdessen die von der <em>Free Software Foundation</em>  herausgegebene <a href="http://www.gnu.org/copyleft/gpl.html">englischsprachige Originalversion</a>.
  </p>
  <p>
    &nbsp;
  </p>
  <p>
    <em>This is a translation of the GNU General Public License into German. This translation is distributed in the hope that it will facilitate understanding, but it is not an official or legally approved translation.</em>
  </p>
  <p>
    <em>The Free Software Foundation is not the publisher of this translation and has not approved it as a legal substitute for the authentic GNU General Public License. The translation has not been reviewed carefully by lawyers, and therefore the translator cannot be sure that it exactly represents the legal meaning of the GNU General Public License. If you wish to be sure whether your planned activities are permitted by the GNU General Public License, please refer to the <a href="http://www.gnu.org/copyleft/gpl.html">authentic English version</a>.</em>
  </p>
  <p>
    <em>The Free Software Foundation strongly urges you not to use this translation as the official distribution terms for your programs; instead, please use the <a href="http://www.gnu.org/copyleft/gpl.html">authentic English version</a> published by the Free Software Foundation.</em>
  </p>
  <h1>
    <a name="gpl">GNU General Public License</a>
  </h1>
  <p><strong>
    Deutsche &Uuml;bersetzung der Version 2, Juni 1991<br>
    Copyright &#169; 1989, 1991 Free Software Foundation, Inc.<br>
    59 Temple Place, Suite 330, Boston, MA 02111-1307, USA
  </strong></p>
  <p><small>
    <a href="mailto:peter@gerwinski.de">peter@gerwinski.de</a>
  </small></p>
  <p>
    Es ist jedermann gestattet, diese Lizenzurkunde zu vervielf&auml;ltigen und unver&auml;nderte Kopien zu verbreiten; &Auml;nderungen sind jedoch nicht erlaubt.
  </p>
  <p>
    <b>Diese &Uuml;bersetzung ist kein rechtskr&auml;ftiger Ersatz f&uuml;r die englischsprachige Originalversion!</b>
  </p>
  <p>
    &nbsp;
  </p>

  <h2>
    <a name="pre">Vorwort</a>
  </h2>
  <p>
    Die meisten Softwarelizenzen sind daraufhin entworfen worden, Ihnen die Freiheit zu nehmen, die Software weiterzugeben und zu ver&auml;ndern. Im Gegensatz dazu soll Ihnen die <em>GNU General Public License</em> , die Allgemeine &Ouml;ffentliche GNU-Lizenz, ebendiese Freiheit garantieren. Sie soll sicherstellen, da&szlig; die Software f&uuml;r alle Benutzer frei ist. Diese Lizenz gilt f&uuml;r den Gro&szlig;teil der von der <em>Free Software Foundation</em>  herausgegebenen Software und f&uuml;r alle anderen Programme, deren Autoren ihr Datenwerk dieser Lizenz unterstellt haben.  Auch Sie k&ouml;nnen diese M&ouml;glichkeit der Lizenzierung f&uuml;r Ihre Programme anwenden. (Ein anderer Teil der Software der <em>Free Software Foundation</em> unterliegt stattdessen der <em>GNU Library General Public License</em> , der Allgemeinen &Ouml;ffentlichen GNU-Lizenz f&uuml;r Bibliotheken.) [Mittlerweile wurde die GNU Library Public License von der GNU Lesser Public License abgel&ouml;st &#150; Anmerkung des &Uuml;bersetzers.]
  </p>
  <p>
    Die Bezeichnung <em>&bdquo;freie&ldquo; Software</em>  bezieht sich auf Freiheit, nicht auf den Preis. Unsere Lizenzen sollen Ihnen die Freiheit garantieren, Kopien freier Software zu verbreiten (und etwas f&uuml;r diesen Service zu berechnen, wenn Sie m&ouml;chten), die M&ouml;glichkeit, die Software im Quelltext zu erhalten oder den Quelltext auf Wunsch zu bekommen. Die Lizenzen sollen garantieren, da&szlig; Sie die Software &auml;ndern oder Teile davon in neuen freien Programmen verwenden d&uuml;rfen &#150; und da&szlig; Sie wissen, da&szlig; Sie dies alles tun d&uuml;rfen.
  </p>
  <p>
    Um Ihre Rechte zu sch&uuml;tzen, m&uuml;ssen wir Einschr&auml;nkungen machen, die es jedem verbieten, Ihnen diese Rechte zu verweigern oder Sie aufzufordern, auf diese Rechte zu verzichten. Aus diesen Einschr&auml;nkungen folgen bestimmte Verantwortlichkeiten f&uuml;r Sie, wenn Sie Kopien der Software verbreiten oder sie ver&auml;ndern.
  </p>
  <p>
    Beispielsweise m&uuml;ssen Sie den Empf&auml;ngern alle Rechte gew&auml;hren, die Sie selbst haben, wenn Sie &#150; kostenlos oder gegen Bezahlung &#150; Kopien eines solchen Programms verbreiten. Sie m&uuml;ssen sicherstellen, da&szlig; auch die Empf&auml;nger den Quelltext erhalten bzw.&nbsp;erhalten k&ouml;nnen. Und Sie m&uuml;ssen ihnen diese Bedingungen zeigen, damit sie ihre Rechte kennen.
  </p>
  <p>
    Wir sch&uuml;tzen Ihre Rechte in zwei Schritten:
  </p>
  <ol>
    <li>
      Wir stellen die Software unter ein Urheberrecht (Copyright), und
    </li>
    <li>
      wir bieten Ihnen diese Lizenz an, die Ihnen das Recht gibt, die Software zu vervielf&auml;ltigen, zu verbreiten und/oder zu ver&auml;ndern.
    </li>
  </ol>
  <p>
    Um die Autoren und uns zu sch&uuml;tzen, wollen wir dar&uuml;berhinaus sicherstellen, da&szlig; jeder erf&auml;hrt, da&szlig; f&uuml;r diese freie Software keinerlei Garantie besteht. Wenn die Software von jemand anderem modifiziert und weitergegeben wird, m&ouml;chten wir, da&szlig; die Empf&auml;nger wissen, da&szlig; sie nicht das Original erhalten haben, damit irgendwelche von anderen verursachte Probleme nicht den Ruf des urspr&uuml;nglichen Autors sch&auml;digen.
  </p>
  <p>
    Schlie&szlig;lich und endlich ist jedes freie Programm permanent durch Software-Patente bedroht. Wir m&ouml;chten die Gefahr ausschlie&szlig;en, da&szlig; Distributoren eines freien Programms individuell Patente lizensieren &#150; mit dem Ergebnis, da&szlig; das Programm propriet&auml;r w&uuml;rde. Um dies zu verhindern, haben wir klargestellt, da&szlig; jedes Patent entweder f&uuml;r freie Benutzung durch jedermann lizenziert werden mu&szlig; oder &uuml;berhaupt nicht lizenziert werden darf.
  </p>
  <p>
    Es folgen die genauen Bedingungen f&uuml;r die Vervielf&auml;ltigung, Verbreitung und Bearbeitung:
  </p>
  <p>
    &nbsp;
  </p>
  <h2>
    <a name="term">Allgemeine &Ouml;ffentliche GNU-Lizenz Bedingungen f&uuml;r die Vervielf&auml;ltigung, Verbreitung und Bearbeitung</a>
  </h2>
  <ol start="0">
    <li>
      <p>
        Diese Lizenz gilt f&uuml;r jedes Programm und jedes andere Datenwerk, in dem ein entsprechender Vermerk des Copyright-Inhabers darauf hinweist, da&szlig; das Datenwerk unter den Bestimmungen dieser <em> General Public License</em> verbreitet werden darf. Im folgenden wird jedes derartige Programm oder Datenwerk als &bdquo;das Programm&ldquo; bezeichnet; die Formulierung &bdquo;auf dem Programm basierendes Datenwerk&ldquo; bezeichnet das Programm sowie jegliche Bearbeitung des Programms im urheberrechtlichen Sinne, also ein Datenwerk, welches das Programm, auch auszugsweise, sei es unver&auml;ndert oder ver&auml;ndert und/oder in eine andere Sprache &uuml;bersetzt, enth&auml;lt. (Im folgenden wird die &Uuml;bersetzung ohne Einschr&auml;nkung als &bdquo;Bearbeitung&ldquo; eingestuft.) Jeder Lizenznehmer wird im folgenden als &bdquo;Sie&ldquo; angesprochen.
      </p>
      <p>
        Andere Handlungen als Vervielf&auml;ltigung, Verbreitung und Bearbeitung werden von dieser Lizenz nicht ber&uuml;hrt; sie fallen nicht in ihren Anwendungsbereich. Der Vorgang der Ausf&uuml;hrung des Programms wird nicht eingeschr&auml;nkt, und die Ausgaben des Programms unterliegen dieser Lizenz nur, wenn der Inhalt ein auf dem Programm basierendes Datenwerk darstellt (unabh&auml;ngig davon, da&szlig; die Ausgabe durch die Ausf&uuml;hrung des Programmes erfolgte). Ob dies zutrifft, h&auml;ngt von den Funktionen des Programms ab.
      </p>
    </li>
    <li>
      <p>
        Sie d&uuml;rfen auf beliebigen Medien unver&auml;nderte Kopien des Quelltextes des Programms, wie sie ihn erhalten haben, anfertigen und verbreiten. Voraussetzung hierf&uuml;r ist, da&szlig; Sie mit jeder Kopie einen entsprechenden Copyright-Vermerk sowie einen Haftungsausschlu&szlig; ver&ouml;ffentlichen, alle Vermerke, die sich auf diese Lizenz und das Fehlen einer Garantie beziehen, unver&auml;ndert lassen und desweiteren allen anderen Empf&auml;ngern des Programms zusammen mit dem Programm eine Kopie dieser Lizenz zukommen lassen.
      </p>
      <p>
        Sie d&uuml;rfen f&uuml;r den eigentlichen Kopiervorgang eine Geb&#252;hr verlangen. Wenn Sie es w&uuml;nschen, d&uuml;rfen Sie auch gegen Entgeld eine Garantie f&uuml;r das Programm anbieten.
      </p>
    </li>
    <li>
      <p>
        Sie d&uuml;rfen Ihre Kopie(n) des Programms oder eines Teils davon ver&auml;ndern, wodurch ein auf dem Programm basierendes Datenwerk entsteht; Sie d&uuml;rfen derartige Bearbeitungen unter den Bestimmungen von Paragraph 1 vervielf&auml;ltigen und verbreiten, vorausgesetzt, da&szlig; zus&auml;tzlich alle im folgenden genannten Bedingungen erf&uuml;llt werden:
      </p>
      <ol type="a">
        <li>
          Sie m&uuml;ssen die ver&auml;nderten Dateien mit einem auff&auml;lligen Vermerk versehen, der auf die von Ihnen vorgenommene Modifizierung und das Datum jeder &Auml;nderung hinweist.
        </li>
        <li>
          Sie m&uuml;ssen daf&uuml;r sorgen, da&szlig; jede von Ihnen verbreitete oder ver&ouml;ffentlichte Arbeit, die ganz oder teilweise von dem Programm oder Teilen davon abgeleitet ist, Dritten gegen&uuml;ber als Ganzes unter den Bedingungen dieser Lizenz ohne Lizenzgeb&uuml;hren zur Verf&uuml;gung gestellt wird.
        </li>
        <li>
          Wenn das ver&auml;nderte Programm normalerweise bei der Ausf&uuml;hrung interaktiv Kommandos einliest, m&uuml;ssen Sie daf&uuml;r sorgen, da&szlig; es, wenn es auf dem &uuml;blichsten Wege f&uuml;r solche interaktive Nutzung gestartet wird, eine Meldung ausgibt oder ausdruckt, die einen geeigneten Copyright-Vermerk enth&auml;lt sowie einen Hinweis, da&szlig; es keine Gew&auml;hrleistung gibt (oder anderenfalls, da&szlig; Sie Garantie leisten), und da&szlig; die Benutzer das Programm unter diesen Bedingungen weiter verbreiten d&uuml;rfen. Auch mu&szlig; der Benutzer darauf hingewiesen werden, wie er eine Kopie dieser Lizenz ansehen kann. (Ausnahme: Wenn das Programm selbst interaktiv arbeitet, aber normalerweise keine derartige Meldung ausgibt, mu&szlig; Ihr auf dem Programm basierendes Datenwerk auch keine solche Meldung ausgeben).
        </li>
      </ol>
      <p>
        Diese Anforderungen gelten f&uuml;r das bearbeitete Datenwerk als Ganzes. Wenn identifizierbare Teile des Datenwerkes nicht von dem Programm abgeleitet sind und vern&uuml;nftigerweise als unabh&auml;ngige und eigenst&auml;ndige Datenwerke f&uuml;r sich selbst zu betrachten sind, dann gelten diese Lizenz und ihre Bedingungen nicht f&uuml;r die betroffenen Teile, wenn Sie diese als eigenst&auml;ndige Datenwerke weitergeben.  Wenn Sie jedoch dieselben Abschnitte als Teil eines Ganzen weitergeben, das ein auf dem Programm basierendes Datenwerk darstellt, dann mu&szlig; die Weitergabe des Ganzen nach den Bedingungen dieser Lizenz erfolgen, deren Bedingungen f&uuml;r weitere Lizenznehmer somit auf das gesamte Ganze ausgedehnt werden &#150; und somit auf jeden einzelnen Teil, unabh&auml;ngig vom jeweiligen Autor.
      </p>
      <p>
        Somit ist es nicht die Absicht dieses Abschnittes, Rechte f&uuml;r Datenwerke in Anspruch zu nehmen oder Ihnen die Rechte f&uuml;r Datenwerke streitig zu machen, die komplett von Ihnen geschrieben wurden; vielmehr ist es die Absicht, die Rechte zur Kontrolle der Verbreitung von Datenwerken, die auf dem Programm basieren oder unter seiner auszugsweisen Verwendung zusammengestellt worden sind, auszu&uuml;ben.
      </p>
      <p>
        Ferner bringt auch das einfache Zusammenlegen eines anderen Datenwerkes, das nicht auf dem Programm basiert, mit dem Programm oder einem auf dem Programm basierenden Datenwerk auf ein- und demselben Speicher- oder Vertriebsmedium dieses andere Datenwerk nicht in den Anwendungsbereich dieser Lizenz.
      </p>
    </li>
    <li>
      <p>
        Sie d&uuml;rfen das Programm (oder ein darauf basierendes Datenwerk gem&auml;&szlig; Paragraph 2) als Objectcode oder in ausf&uuml;hrbarer Form unter den Bedingungen der Paragraphen 1 und 2 kopieren und weitergeben &#150; vorausgesetzt, da&szlig; Sie au&szlig;erdem eine der folgenden Leistungen erbringen:
      </p>
      <ol type="a">
        <li>
          Liefern Sie das Programm zusammen mit dem vollst&auml;ndigen
zugeh&ouml;rigen maschinenlesbaren Quelltext auf einem f&uuml;r den Datenaustausch &uuml;blichen Medium aus, wobei die Verteilung unter den Bedingungen der Paragraphen 1 und 2 erfolgen mu&szlig;. Oder:
        </li>
        <li>
          Liefern Sie das Programm zusammen mit einem mindestens drei Jahre lang g&uuml;ltigen schriftlichen Angebot aus, jedem Dritten eine vollst&auml;ndige maschinenlesbare Kopie des Quelltextes zur Verf&uuml;gung zu stellen &#150; zu nicht h&ouml;heren Kosten als denen, die durch den physikalischen Kopiervorgang anfallen &#150;, wobei der Quelltext unter den Bedingungen der Paragraphen 1 und 2 auf einem f&uuml;r den Datenaustausch &uuml;blichen Medium weitergegeben wird. Oder:
        </li>
        <li>
          Liefern Sie das Programm zusammen mit dem schriftlichen Angebot der Zurverf&uuml;gungstellung des Quelltextes aus, das Sie selbst erhalten haben. (Diese Alternative ist nur f&uuml;r nicht-kommerzielle Verbreitung zul&auml;ssig und nur, wenn Sie das Programm als Objectcode oder in ausf&uuml;hrbarer Form mit einem entsprechenden Angebot gem&auml;&szlig; Absatz b erhalten haben.)
        </li>
      </ol>
      <p>
        Unter dem Quelltext eines Datenwerkes wird diejenige Form des Datenwerkes verstanden, die f&uuml;r Bearbeitungen vorzugsweise verwendet wird. F&uuml;r ein ausf&uuml;hrbares Programm bedeutet &bdquo;der komplette Quelltext&ldquo;: Der Quelltext aller im Programm enthaltenen Module einschlie&szlig;lich aller zugeh&ouml;rigen Modulschnittstellen-Definitionsdateien sowie der zur Compilation und Installation verwendeten Skripte. Als besondere Ausnahme jedoch braucht der verteilte Quelltext nichts von dem zu enthalten, was &uuml;blicherweise (entweder als Quelltext oder in bin&auml;rer Form) zusammen mit den Hauptkomponenten des Betriebssystems (Kernel, Compiler usw.) geliefert wird, unter dem das Programm l&auml;uft &#150; es sei denn, diese Komponente selbst geh&ouml;rt zum ausf&uuml;hrbaren Programm.
      </p>
      <p>
        Wenn die Verbreitung eines ausf&uuml;hrbaren Programms oder von Objectcode dadurch erfolgt, da&szlig; der Kopierzugriff auf eine daf&uuml;r vorgesehene Stelle gew&auml;hrt wird, so gilt die Gew&auml;hrung eines gleichwertigen Zugriffs auf den Quelltext als Verbreitung des Quelltextes, auch wenn Dritte nicht dazu gezwungen sind, den Quelltext zusammen mit dem Objectcode zu kopieren.
      </p>
    </li>
    <li>
      <p>
        Sie d&uuml;rfen das Programm nicht vervielf&auml;ltigen, ver&auml;ndern, weiter lizenzieren oder verbreiten, sofern es nicht durch diese Lizenz ausdr&uuml;cklich gestattet ist. Jeder anderweitige Versuch der Vervielf&auml;ltigung, Modifizierung, Weiterlizenzierung und Verbreitung ist nichtig und beendet automatisch Ihre Rechte unter dieser Lizenz. Jedoch werden die Lizenzen Dritter, die von Ihnen Kopien oder Rechte unter dieser Lizenz erhalten haben, nicht beendet, solange diese die Lizenz voll anerkennen und befolgen.
      </p>
    </li>
    <li>
      <p>
        Sie sind nicht verpflichtet, diese Lizenz anzunehmen, da Sie sie nicht unterzeichnet haben. Jedoch gibt Ihnen nichts anderes die Erlaubnis, das Programm oder von ihm abgeleitete Datenwerke zu ver&auml;ndern oder zu verbreiten. Diese Handlungen sind gesetzlich verboten, wenn Sie diese Lizenz nicht anerkennen. Indem Sie das Programm (oder ein darauf basierendes Datenwerk) ver&auml;ndern oder verbreiten, erkl&auml;ren Sie Ihr Einverst&auml;ndnis mit dieser Lizenz und mit allen ihren Bedingungen bez&uuml;glich der Vervielf&auml;ltigung, Verbreitung und Ver&auml;nderung des Programms oder eines darauf basierenden Datenwerks.
      </p>
    </li>
    <li>
      <p>
        Jedesmal, wenn Sie das Programm (oder ein auf dem Programm basierendes Datenwerk) weitergeben, erh&auml;lt der Empf&auml;nger automatisch vom urspr&uuml;nglichen Lizenzgeber die Lizenz, das Programm entsprechend den hier festgelegten Bestimmungen zu vervielf&auml;ltigen, zu verbreiten und zu ver&auml;ndern. Sie d&uuml;rfen keine weiteren Einschr&auml;nkungen der Durchsetzung der hierin zugestandenen Rechte des Empf&auml;ngers vornehmen. Sie sind nicht daf&uuml;r verantwortlich, die Einhaltung dieser Lizenz durch Dritte durchzusetzen.
      </p>
    </li>
    <li>
      <p>
        Sollten Ihnen infolge eines Gerichtsurteils, des Vorwurfs einer Patentverletzung oder aus einem anderen Grunde (nicht auf Patentfragen begrenzt) Bedingungen (durch Gerichtsbeschlu&szlig;, Vergleich oder anderweitig) auferlegt werden, die den Bedingungen dieser Lizenz widersprechen, so befreien Sie diese Umst&auml;nde nicht von den Bestimmungen dieser Lizenz. Wenn es Ihnen nicht m&ouml;glich ist, das Programm unter gleichzeitiger Beachtung der Bedingungen in dieser Lizenz und Ihrer anderweitigen Verpflichtungen zu verbreiten, dann d&uuml;rfen Sie als Folge das Programm &uuml;berhaupt nicht verbreiten. Wenn zum Beispiel ein Patent nicht die geb&uuml;hrenfreie Weiterverbreitung des Programms durch diejenigen erlaubt, die das Programm direkt oder indirekt von Ihnen erhalten haben, dann besteht der einzige Weg, sowohl das Patentrecht als auch diese Lizenz zu befolgen, darin, ganz auf die Verbreitung des Programms zu verzichten.
      </p>
      <p>
        Sollte sich ein Teil dieses Paragraphen als ung&uuml;ltig oder unter bestimmten Umst&auml;nden nicht durchsetzbar erweisen, so soll dieser Paragraph seinem Sinne nach angewandt werden; im &uuml;brigen soll dieser Paragraph als Ganzes gelten.
      </p>
      <p>
        Zweck dieses Paragraphen ist nicht, Sie dazu zu bringen, irgendwelche Patente oder andere Eigentumsanspr&uuml;che zu verletzen oder die G&uuml;ltigkeit solcher Anspr&uuml;che zu bestreiten; dieser Paragraph hat einzig den Zweck, die Integrit&auml;t des Verbreitungssystems der freien Software zu sch&uuml;tzen, das durch die Praxis &ouml;ffentlicher Lizenzen verwirklicht wird. Viele Leute haben gro&szlig;z&uuml;gige Beitr&auml;ge zu dem gro&szlig;en Angebot der mit diesem System verbreiteten Software im Vertrauen auf die konsistente Anwendung dieses Systems geleistet; es liegt am Autor/Geber, zu entscheiden, ob er die Software mittels irgendeines anderen Systems verbreiten will; ein Lizenznehmer hat auf diese Entscheidung keinen Einflu&szlig;.
      </p>
      <p>
        Dieser Paragraph ist dazu gedacht, deutlich klarzustellen, was als Konsequenz aus dem Rest dieser Lizenz betrachtet wird.
      </p>
    </li>
    <li>
      <p>
        Wenn die Verbreitung und/oder die Benutzung des Programms in bestimmten Staaten entweder durch Patente oder durch urheberrechtlich gesch&uuml;tzte Schnittstellen eingeschr&auml;nkt ist, kann der Urheberrechtsinhaber, der das Programm unter diese Lizenz gestellt hat, eine explizite geographische Begrenzung der Verbreitung angeben, in der diese Staaten ausgeschlossen werden, so da&szlig; die Verbreitung nur innerhalb und zwischen den Staaten erlaubt ist, die nicht ausgeschlossen sind. In einem solchen Fall beinhaltet diese Lizenz die Beschr&auml;nkung, als w&auml;re sie in diesem Text niedergeschrieben.
      </p>
    </li>
    <li>
      <p>
        Die <em>Free Software Foundation</em>  kann von Zeit zu Zeit &uuml;berarbeitete und/oder neue Versionen der <em>General Public License</em>  ver&ouml;ffentlichen. Solche neuen Versionen werden vom Grundprinzip her der gegenw&auml;rtigen entsprechen, k&ouml;nnen aber im Detail abweichen, um neuen Problemen und Anforderungen gerecht zu werden.
      </p>
      <p>
        Jede Version dieser Lizenz hat eine eindeutige Versionsnummer. Wenn in einem Programm angegeben wird, da&szlig; es dieser Lizenz in einer bestimmten Versionsnummer oder &bdquo;jeder sp&auml;teren Version&ldquo; <em>(&quot;any later version&quot;)</em>  unterliegt, so haben Sie die Wahl, entweder den Bestimmungen der genannten Version zu folgen oder denen jeder beliebigen sp&auml;teren Version, die von der <em>Free Software Foundation</em>  ver&ouml;ffentlicht wurde. Wenn das Programm keine Versionsnummer angibt, k&ouml;nnen Sie eine beliebige Version w&auml;hlen, die je von der <em>Free Software Foundation</em>  ver&ouml;ffentlicht wurde.
      </p>
    </li>
    <li>
      <p>
        Wenn Sie den Wunsch haben, Teile des Programms in anderen freien Programmen zu verwenden, deren Bedingungen f&uuml;r die Verbreitung anders sind, schreiben Sie an den Autor, um ihn um die Erlaubnis zu bitten. F&uuml;r Software, die unter dem Copyright der <em>Free Software Foundation</em>  steht, schreiben Sie an die <em>Free Software Foundation</em> ; wir machen zu diesem Zweck gelegentlich Ausnahmen. Unsere Entscheidung wird von den beiden Zielen geleitet werden, zum einen den freien Status aller von unserer freien Software abgeleiteten Datenwerke zu erhalten und zum anderen das gemeinschaftliche Nutzen und Wiederverwenden von Software im allgemeinen zu f&ouml;rdern.
      </p>
    </li>
  </ol>

  <h2>
    KEINE GEW&Auml;HRLEISTUNG
  </h2>
  <ol start="11">
    <li>
      <p>
        DA DAS PROGRAMM OHNE JEGLICHE KOSTEN LIZENZIERT WIRD, BESTEHT KEINERLEI GEW&Auml;HRLEISTUNG F&Uuml;R DAS PROGRAMM, SOWEIT DIES GESETZLICH ZUL&Auml;SSIG IST. SOFERN NICHT ANDERWEITIG SCHRIFTLICH BEST&Auml;TIGT, STELLEN DIE COPYRIGHT-INHABER UND/ODER DRITTE DAS PROGRAMM SO ZUR VERF&Uuml;GUNG, &bdquo;WIE ES IST&ldquo;, OHNE IRGENDEINE GEW&Auml;HRLEISTUNG, WEDER AUSDR&Uuml;CKLICH NOCH IMPLIZIT, EINSCHLIESSLICH &#150; ABER NICHT BEGRENZT AUF &#150; MARKTREIFE ODER VERWENDBARKEIT F&Uuml;R EINEN BESTIMMTEN ZWECK. DAS VOLLE RISIKO BEZ&Uuml;GLICH QUALIT&Auml;T UND LEISTUNGSF&Auml;HIGKEIT DES PROGRAMMS LIEGT BEI IHNEN. SOLLTE SICH DAS PROGRAMM ALS FEHLERHAFT HERAUSSTELLEN, LIEGEN DIE KOSTEN F&Uuml;R NOTWENDIGEN SERVICE, REPARATUR ODER KORREKTUR BEI IHNEN.
      </p>
    </li>
    <li>
      <p>
        IN KEINEM FALL, AUSSER WENN DURCH GELTENDES RECHT GEFORDERT ODER SCHRIFTLICH ZUGESICHERT, IST IRGENDEIN COPYRIGHT-INHABER ODER IRGENDEIN DRITTER, DER DAS PROGRAMM WIE OBEN ERLAUBT MODIFIZIERT ODER VERBREITET HAT, IHNEN GEGEN&Uuml;BER F&Uuml;R IRGENDWELCHE SCH&Auml;DEN HAFTBAR, EINSCHLIESSLICH JEGLICHER ALLGEMEINER ODER SPEZIELLER SCH&Auml;DEN, SCH&Auml;DEN DURCH SEITENEFFEKTE (NEBENWIRKUNGEN) ODER FOLGESCH&Auml;DEN, DIE AUS DER BENUTZUNG DES PROGRAMMS ODER DER UNBENUTZBARKEIT DES PROGRAMMS FOLGEN (EINSCHLIESSLICH &#150; ABER NICHT BESCHR&Auml;NKT AUF &#150; DATENVERLUSTE, FEHLERHAFTE VERARBEITUNG VON DATEN, VERLUSTE, DIE VON IHNEN ODER ANDEREN GETRAGEN WERDEN M&Uuml;SSEN, ODER DEM UNVERM&Ouml;GEN DES PROGRAMMS, MIT IRGENDEINEM ANDEREN PROGRAMM ZUSAMMENZUARBEITEN), SELBST WENN EIN COPYRIGHT-INHABER ODER DRITTER &Uuml;BER DIE M&Ouml;GLICHKEIT SOLCHER SCH&Auml;DEN UNTERRICHTET WORDEN WAR.
      </p>
    </li>
  </ol>
  <h2>
    ENDE DER BEDINGUNGEN
  </h2>
  <p>
    &nbsp;
  </p>
  <h2>
    <a name="app">Anhang: Wie Sie diese Bedingungen auf Ihre eigenen, neuen Programme anwenden k&ouml;nnen</a>
  </h2>
  <p>
    Wenn Sie ein neues Programm entwickeln und wollen, da&szlig; es vom gr&ouml;&szlig;tm&ouml;glichen Nutzen f&uuml;r die Allgemeinheit ist, dann erreichen Sie das am besten, indem Sie es zu freier Software machen, die jeder unter diesen Bestimmungen weiterverbreiten und ver&auml;ndern kann.
  </p>
  <p>
    Um dies zu erreichen, f&uuml;gen Sie die folgenden Vermerke zu Ihrem Programm hinzu. Am sichersten ist es, sie an den Anfang einer jeden Quelldatei zu stellen, um den Gew&auml;hrleistungsausschlu&szlig; m&ouml;glichst deutlich darzustellen; zumindest aber sollte jede Datei eine Copyright-Zeile besitzen sowie einen kurzen Hinweis darauf, wo die vollst&auml;ndigen Vermerke zu finden sind.
  </p>
  <blockquote>
    <p><tt>
      one line to give the program's name and an idea of what it does.<br>
      Copyright (C) yyyy name of author 
    </tt></p>
    <p><tt>
      This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
    </tt></p>
    <p><tt>
      This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
    </tt></p>
    <p><tt>
      You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307, USA.
    </tt></p>
  </blockquote>
  <p>
    Auf Deutsch:
  </p>
  <blockquote>
    <p><tt>
      eine Zeile mit dem Programmnamen und einer kurzen Beschreibung<br>
      Copyright (C) jjjj Name des Autors 
    </tt></p>
    <p><tt>
      Dieses Programm ist freie Software. Sie k&ouml;nnen es unter den Bedingungen der GNU General Public License, wie von der Free Software Foundation ver&ouml;ffentlicht, weitergeben und/oder modifizieren, entweder gem&auml;&szlig; Version 2 der Lizenz oder (nach Ihrer Option) jeder sp&auml;teren Version. 
    </tt></p>
    <p><tt>
      Die Ver&ouml;ffentlichung dieses Programms erfolgt in der Hoffnung, da&szlig; es Ihnen von Nutzen sein wird, aber OHNE IRGENDEINE GARANTIE, sogar ohne die implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT F&Uuml;R EINEN BESTIMMTEN ZWECK. Details finden Sie in der GNU General Public License. 
    </tt></p>
    <p><tt>
      Sie sollten eine Kopie der GNU General Public License zusammen mit diesem Programm erhalten haben. Falls nicht, schreiben Sie an die Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307, USA. 
    </tt></p>
  </blockquote>
  <p>
    F&uuml;gen Sie auch einen kurzen Hinweis hinzu, wie Sie elektronisch und per Brief erreichbar sind.
  </p>
  <p>
    Wenn Ihr Programm interaktiv ist, sorgen Sie daf&uuml;r, da&szlig; es nach dem Start einen kurzen Vermerk ausgibt:
  </p>
  <blockquote>
    <p><tt>
      Gnomovision version 69, Copyright (C) yyyy name of author<br>
      Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'. This is free software, and you are welcome to redistribute it under certain conditions; type `show c' for details. 
    </tt></p>
  </blockquote>
  <p>
    Auf Deutsch:
  </p>
  <blockquote>
    <p><tt>
      Gnomovision Version 69, Copyright (C) jjjj Name des Autors<br>
      F&uuml;r Gnomovision besteht KEINERLEI GARANTIE; geben Sie `show w' f&uuml;r Details ein. Gnonovision ist freie Software, die Sie unter bestimmten Bedingungen weitergeben d&uuml;rfen; geben Sie `show c' f&uuml;r Details ein. 
    </tt></p>
  </blockquote>
  <p>
    Die hypothetischen Kommandos <code>`show w'</code> und <code>`show c'</code> sollten die entsprechenden Teile der GNU-GPL anzeigen. Nat&uuml;rlich k&ouml;nnen die von Ihnen verwendeten Kommandos anders hei&szlig;en als <code>`show w'</code> und <code>`show c'</code>; es k&ouml;nnten auch Mausklicks oder Men&uuml;punkte sein &#150; was immer am besten in Ihr Programm pa&szlig;t.
  </p>
  <p>
    Soweit vorhanden, sollten Sie auch Ihren Arbeitgeber (wenn Sie als Programmierer arbeiten) oder Ihre Schule einen Copyright-Verzicht f&uuml;r das Programm unterschreiben lassen. Hier ein Beispiel. Die Namen m&uuml;ssen Sie nat&uuml;rlich &auml;ndern.
  </p>
  <blockquote>
    <p><tt>
      Yoyodyne, Inc., hereby disclaims all copyright interest in th program `Gnomovision' (which makes passes at compilers) written by James Hacker. 
    </tt></p>
    <p><tt>
      signature of Ty Coon, 1 April 1989<br>
      Ty Coon, President of Vice 
    </tt></p>
  </blockquote>
  <p>
    Auf Deutsch:
  </p>
  <blockquote>
    <p><tt>
      Die Yoyodyne GmbH erhebt keinen urheberrechtlichen Anspruch auf das von James Hacker geschriebene Programm ,Gnomovision` (einem Schrittmacher f&uuml;r Compiler).
    </tt></p>
    <p><tt>
      Unterschrift von Ty Coon, 1. April 1989<br>
      Ty Coon, Vizepr&auml;sident 
    </tt></p>
  </blockquote>
  <p>
    Diese <em>General Public License</em>  gestattet nicht die Einbindung des Programms in propriet&auml;re Programme. Ist Ihr Programm eine Funktionsbibliothek, so kann es sinnvoller sein, das Binden propriet&auml;rer Programme mit dieser Bibliothek zu gestatten. Wenn Sie dies tun wollen, sollten Sie die GNU Library General Public License anstelle dieser Lizenz verwenden.
  </p>
  <p>
    &nbsp;
  </p>
  <h1>
    <a name="about">&Uuml;ber dieses Dokument...</a>
  </h1> 
  <p><strong>
    GNU General Public License
  </strong></p>
  <p>
    This document was generated using the
<a href="http://www-dsed.llnl.gov/files/programs/unix/latex2html/manual/"><strong>LaTeX</strong>2<tt>HTML</tt></a> translator Version 97.1 (release) (July 13th, 1997)
  </p>
  <p>
    Copyright &#169; 1993, 1994, 1995, 1996, 1997, <a href="http://cbl.leeds.ac.uk/nikos/personal.html">Nikos Drakos</a>, 
Computer Based Learning Unit, University of Leeds.
  </p>
  <p>
    The command line arguments were:<br>
    <strong>latex2html</strong> <tt>-split 0 gpl-ger.tex</tt>.
  </p>
  <p>
    The translation was initiated by Peter Gerwinski on 10/16/2000
  </p>
  <hr>
  <address>
    <i>Peter Gerwinski</i><br>
    <i>10/16/2000</i>
  </address>
  <hr>
  <p>
    Der HTML-Code dieser Seite wurde am 6. Februar 2003 von Alexander Nouak optimiert. Inhaltliche &Auml;nderungen an der deutschen &Uuml;bersetzung der GNU&nbsp;GPL wurden jedoch nicht vorgenommen.
  </p>
</body>
</html>
