COMP 7481 - Android Application Development/Assignment_02_Server/app/controllers/posts_controller.rb

INSERT INTO `posts` (`message`, `updated_at`, `entry_time`, `created_at`) VALUES ('test message', '2011-02-10 05:57:51', NULL, '2011-02-10 05:57:51')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save