Guild Notes/app/controllers/characters_controller.rb

SELECT * FROM "characters" WHERE ("characters"."id" = 1 AND ("characters".person_id = 1))
---
  def show
    @person = Person.find(params[:person_id])
    @character = @person.characters.find(params[:id])

INSERT INTO "characters" ("name", "updated_at", "notes", "char_class", "person_id", "created_at") VALUES(NULL, '2009-06-03 14:28:33', NULL, NULL, 1, '2009-06-03 14:28:33')
---
  def create
    @person = Person.find(params[:person_id])
    @character = @person.characters.build(params[:character])
    if @character.save

SELECT * FROM "characters" WHERE ("characters"."id" = 1 AND ("characters".person_id = 1))
---
  def edit
    @person = Person.find(params[:person_id])
    @character = @person.characters.find(params[:id])

SELECT * FROM "characters" WHERE ("characters"."id" = 1)
---
  def update
    @person = Person.find(params[:person_id])
    @character = Character.find(params[:id])

SELECT * FROM "characters" WHERE ("characters"."id" = 1)
DELETE FROM "characters" WHERE "id" = 1
---
  def destroy
    @person = Person.find(params[:person_id])
    @character = Character.find(params[:id])
    @character.destroy